BUTTON_ONWARD_VOLONTEERING = 'Онвард волонтёр'
BUTTON_ONWARD_CAMPUS = 'Онвард Кампус'
BUTTON_MASA_4_6_MONTHS = 'МАСА 4-6 месяцев'
LINK_ONWARD_VOLONTEERING = 'https://israelway.ru/onward-volunteering'
LINK_ONWARD_CAMPUS = 'https://israelway.ru/onward-campus'
LINK_ALL_PROGRAMS = 'https://israelway.ru/masa/all-programs/'
LINK_DOWNLOAD_APP = "https://pinsteps.page.link/download"
TEXT_BOT_GREETINGS = "Проверьте ваше право получить финансируемую программу, " \
                     "задавайте вопросы и общайтесь с координаторами и не уходите без подарка - " \
                     "код на платную экскурсию в цифровом путеводителе по Израилю 🇮🇱!"
SITE_LINK = 'https://israelway.ru'
TEXT_GIFT_INSTRUCTIONS = "Чтобы получить в подарок платную цифровую экскурсию вот что надо сделать:\n\n" \
                         "1. Установите путеводитель по миру Pinsteps - <a href='https://pinsteps.page.link/download'>скачать</a>\n" \
                         "2. Выберите платную экскурсию в Израиле\n" \
                         "3. Поделитесь ею (ссылкой на экскурсию из приложения) с нашим координатором в чате\n" \
                         "4. Получите от коодинатора код и введите его в приложении"
COORDINATOR_LINK = 'https://t.me/israelway_IW'
BUTTON_READY_TO_GET_CODE = 'Готов получить код!'
TEXT_STEP_1_WELCOME_STEP = "Ответы на два вопроса помогут вам понять, " \
                           "подходите ли вы для участия в финансируемых программах, " \
                           "и предложат список программ, соответствующих вашим критериям.\n\n" \
                           "Вопрос первый. Есть ли у вас еврейские корни? " \
                           "(Ваши или вашего супруга или супруги бабушка или дедушка со стороны матери или со стороны отца - евреи)"
TEXT_WAITING_FOR_AGE_INPUT = "Последний раз вы указали, что у вас есть еврейские корни. Мы ждем, чтобы вы написали в ответ число - ваш возраст, чтобы проверить, какая программа вам подходит :)"
TEXT_YOUP_PICKED_AGE = "Вы указали возраст %s"
TEXT_STEP_1_PROGRAMS_DENIED = "К сожалению, вы не можете претендовать на участие в программах Маса и Онвард, " \
                              "однако вы можете проверить варианты сотрудничества с нами - переходите к переписке с координатором"
TEXT_STEP_1_PROGRAMS_17_31 = "Поздравляем, вы можете подавать вашу кандидатуру на участие в программах <a href='https://israelway.ru/masa/all-programs/'>МАСА</a> длительностью до шести месяцев, на программу <a href='https://israelway.ru/onward-campus'>Онвард Кампус</a> длительностью до месяца и на программу <a href='https://israelway.ru/onward-volunteering'>Онвард волонтёр</a> длительностью до двух недель."
TEXT_STEP_1_PROGRAMS_31_35 = "Поздравляем, вы можете подавать вашу кандидатуру на участие в программах <a href='https://israelway.ru/masa/all-programs/'>МАСА</a> длительностью до шести месяцев и на программу <a href='https://israelway.ru/onward-volunteering'>Онвард волонтёр</a> длительностью до двух недель."
TEXT_STEP_1_PROGRAMS_35_41 = "Поздравляем, вы можете подавать вашу кандидатуру на участие в " + "программе <a href='https://israelway.ru/onward-volunteering'>Онвард волонтёр</a> длительностью до двух недель"
TEXT_STEP_2_HOW_OLD_ARE_YOU = "Сколько вам лет? (число от 17 до 40 включительно)"
TEXT_STEP_1_NO_ROOTS = "К сожалению, вы не сможете получить финансирование, " \
                       "но можете принять участие в программах за полную стоимость.\n" \
                       "Перейти к списку программ - <a href='https://israelway.ru/'>https://israelway.ru/</a>"
TEXT_STEP_1_IDK = "Проверьте свою родословную и убедитесь, что вы подпадаете под закон “О возвращении” " \
                  "(ссылка: <a href='https://www.gov.il/ru/Departments/Policies/government_law_of_return_nativ'>https://www.gov.il/ru/Departments/Policies/government_law_of_return_nativ</a>)" \
                  " и, если результат положительный, вернитесь к процессу регистрации"
CONVERSATION_NAME = "IsraelWay_Conv"
CALLBACK_BUTTON_START_AGAIN = "🔄 Начать заново"
CALLBACK_BUTTON_YES = "✅ Да"
CALLBACK_BUTTON_CHECK_NEW_AGE = "Проверить другой возраст"
CALLBACK_BUTTON_NO = "❌ Нет"
CALLBACK_BUTTON_DONT_KNOW = "🤔 Не знаю"
CALLBACK_BUTTON_CHECK_RIGHTS = "📜 Проверить право"
BUTTON_GET_GIFT = "🎁 Получить подарок"
BUTTON_CHECK_RIGHTS = "📜 Проверить право"
BUTTON_START_AGAIN = "🔄 Начать заново"
BUTTON_BACK = "🔄 В начало"
BUTTON_CONNECT_TO_PERSON = "🙋‍Обратиться к координатору"
BUTTON_GO_TO_SITE = "👉 Перейти на наш сайт"
BUTTON_DOWNLOAD_APP = "📲 Скачать приложение"
